# Pandas Tutorial
### Add/Remove Rows and Columns From DataFrames
**Source:**

Corey Schafer - [Python Pandas Playlist](https://www.youtube.com/playlist?list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS)

In [1]:
import pandas as pd

### Creating a sample DataFrame

In [2]:
people = {
    "first" : ["Parampreet", "Corey", "Anant"],
    "last" : ["Singh", "Schafer", "Luthra"],
    "email" : ["ParampreetSingh@gmail.com", "CoreySchafer@gmail.com", "AnantLuthra@gmail.com"]
}

In [3]:
df = pd.DataFrame(people)
df

        first     last                      email
0  Parampreet    Singh  ParampreetSingh@gmail.com
1       Corey  Schafer     CoreySchafer@gmail.com
2       Anant   Luthra      AnantLuthra@gmail.com

### Adding a new Column

In [4]:
# 1st way
# df["full_name"] = df["first"] + " " + df["last"]
# 2nd way
df["full_name"] = df[["first", "last"]].apply(" ".join, axis=1)
df

        first     last                      email         full_name
0  Parampreet    Singh  ParampreetSingh@gmail.com  Parampreet Singh
1       Corey  Schafer     CoreySchafer@gmail.com     Corey Schafer
2       Anant   Luthra      AnantLuthra@gmail.com      Anant Luthra

### Removing columns

In [5]:
df.drop(columns=["first", "last"], inplace=True)

In [6]:
df

                       email         full_name
0  ParampreetSingh@gmail.com  Parampreet Singh
1     CoreySchafer@gmail.com     Corey Schafer
2      AnantLuthra@gmail.com      Anant Luthra

In [7]:
# expand=True, sets the splited elements in each column
df["full_name"].str.split(" ", expand=True)

            0        1
0  Parampreet    Singh
1       Corey  Schafer
2       Anant   Luthra

In [8]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)

In [9]:
df

                       email         full_name       first     last
0  ParampreetSingh@gmail.com  Parampreet Singh  Parampreet    Singh
1     CoreySchafer@gmail.com     Corey Schafer       Corey  Schafer
2      AnantLuthra@gmail.com      Anant Luthra       Anant   Luthra

### To add a single row, we assign the values to the `df.loc[current_length]`

In [10]:
df.loc[3] = ["ParamSingh@gmail.com", "Param Singh", "Param", "Singh"]

In [11]:
df

                       email         full_name       first     last
0  ParampreetSingh@gmail.com  Parampreet Singh  Parampreet    Singh
1     CoreySchafer@gmail.com     Corey Schafer       Corey  Schafer
2      AnantLuthra@gmail.com      Anant Luthra       Anant   Luthra
3       ParamSingh@gmail.com       Param Singh       Param    Singh

In [20]:
df.loc[len(df.index)] = {"last" : "Singh", "first" : "Karan", "email" : "KaranSingh@email.com", "full_name" : "Karan Singh"}

In [23]:
df

                       email         full_name       first     last
0  ParampreetSingh@gmail.com  Parampreet Singh  Parampreet    Singh
1     CoreySchafer@gmail.com     Corey Schafer       Corey  Schafer
2      AnantLuthra@gmail.com      Anant Luthra       Anant   Luthra
3       ParamSingh@gmail.com       Param Singh       Param    Singh
4       KaranSingh@email.com       Karan Singh       Karan    Singh

#### To create a single row dataframe,
- Either pass index in an iterable
- Or put the values in an iterable

In [49]:
x = pd.DataFrame({"first" : "Jatin"}, index=[0])
x

   first
0  Jatin

In [50]:
y = pd.DataFrame({"first" : ["Karan"]})
y

   first
0  Karan

In [51]:
df = pd.concat([df, x, y], ignore_index=True)

In [52]:
df

                       email         full_name       first     last
0  ParampreetSingh@gmail.com  Parampreet Singh  Parampreet    Singh
1     CoreySchafer@gmail.com     Corey Schafer       Corey  Schafer
2      AnantLuthra@gmail.com      Anant Luthra       Anant   Luthra
3                        NaN               NaN       Jatin      NaN
4                        NaN               NaN       Karan      NaN

### To Drop a row, we use `.drop()` and pass the specific index

In [54]:
df.drop(index=4, inplace=True)

In [56]:
df

                       email         full_name       first     last
0  ParampreetSingh@gmail.com  Parampreet Singh  Parampreet    Singh
1     CoreySchafer@gmail.com     Corey Schafer       Corey  Schafer
2      AnantLuthra@gmail.com      Anant Luthra       Anant   Luthra
3                        NaN               NaN       Jatin      NaN

In [59]:
filt = df["first"]=="Jatin"
df.drop(index=df[filt].index)

                       email         full_name       first     last
0  ParampreetSingh@gmail.com  Parampreet Singh  Parampreet    Singh
1     CoreySchafer@gmail.com     Corey Schafer       Corey  Schafer
2      AnantLuthra@gmail.com      Anant Luthra       Anant   Luthra